# RbsElecCircuitPrefixSeparator Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecCircuitPrefixSeparator Property
ParameterTypeId Class See Also
---
"Circuit Prefix Separator"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecCircuitPrefixSeparator { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecCircuitPrefixSeparator As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecCircuitPrefixSeparator {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace